## Recall: Fuse AI Database


![FuseAI Database](https://drive.google.com/uc?export=view&id=1u-sN7Rcxmf0ea0gEWw5GVMZW4XglZqqJ)

#### Connecting to Sqlite Database

In [1]:
%load_ext sql

In [2]:
%sql sqlite://

'Connected: @None'

#### Minor Differences between sqlite and SQL
```
* INT  ->  INTEGER
* auto_increment -> AUTOINCREMENT
```

#### Create Table

**Syntax**

```
create table <relation_name>(
	<attribute_name>	<data_type>	<integrity_constraint>
	<attribute_name>	<data_type>	<integrity_constraint>
	<attribute_name>	<data_type>	<integrity_constraint>
	<integrity_constraint>
);
```

<br/>

> Create `Student` table

In [4]:
%%sql
CREATE TABLE student(
    student_id INTEGER PRIMARY KEY AUTOINCREMENT,
    student_name VARCHAR(50) NOT NULL,
    student_email VARCHAR(50),
    student_contact VARCHAR(15)
);

 * sqlite://
Done.

[]

<br/>

> Create `Course` table

In [6]:
%%sql
CREATE TABLE course(
    course_id INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT,
    course_name VARCHAR(50) NOT NULL,
    course_length INTEGER
);

 * sqlite://
Done.

[]

<br/>

> Add other tables

In [7]:
%%sql
CREATE TABLE enrollment(student_id INTEGER, course_id INTEGER, FOREIGN KEY(student_id) REFERENCES student(student_id) ON DELETE CASCADE ON UPDATE CASCADE, FOREIGN KEY(course_id) REFERENCES course(course_id) ON DELETE CASCADE ON UPDATE CASCADE);
CREATE TABLE module(course_id INTEGER, module_num INTEGER, module_name VARCHAR(50) NOT NULL, PRIMARY KEY(course_id,module_num), FOREIGN KEY(course_id) REFERENCES course(course_id) ON DELETE CASCADE ON UPDATE CASCADE);
CREATE TABLE unit(course_id INTEGER, module_num INTEGER, unit_num INTEGER, unit_name VARCHAR(50) NOT NULL, time_allotted float, PRIMARY KEY(course_id,module_num,unit_num), FOREIGN KEY(course_id,module_num) REFERENCES module(course_id,module_num) ON DELETE CASCADE ON UPDATE CASCADE);
CREATE TABLE chapter(course_id INTEGER, module_num INTEGER, unit_num INTEGER, chapter_num INTEGER, chapter_name VARCHAR(50) NOT NULL, PRIMARY KEY(course_id, module_num, unit_num, chapter_num), FOREIGN KEY(course_id, module_num, unit_num) REFERENCES unit(course_id,module_num, unit_num) ON DELETE CASCADE ON UPDATE CASCADE);
CREATE TABLE project(course_id INTEGER, module_num INTEGER, project_title VARCHAR(50) NOT NULL, project_marks INTEGER, FOREIGN KEY(course_id,module_num) REFERENCES module(course_id,module_num) ON DELETE CASCADE ON UPDATE CASCADE);
CREATE TABLE assignment(course_id INTEGER,module_num INTEGER,unit_num INTEGER, assignment_name VARCHAR(50) NOT NULL, assignment_marks INTEGER, FOREIGN KEY(course_id, module_num, unit_num) REFERENCES unit(course_id, module_num, unit_num) ON DELETE CASCADE ON UPDATE CASCADE);
CREATE TABLE quiz(course_id INTEGER, module_num INTEGER, unit_num INTEGER, chapter_num INTEGER, num_questions INTEGER, FOREIGN KEY(course_id, module_num, unit_num, chapter_num) REFERENCES chapter(course_id,module_num, unit_num, chapter_num) ON DELETE CASCADE ON UPDATE CASCADE);

 * sqlite://
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

### Insertion

**Syntax:**

`Insert into <table_name> Values('val1','val2',...,'valn')`

<br/>

>Insert values into `Student` table

In [8]:
%%sql
INSERT INTO student ( student_name, student_email)
VALUES ('John Doe', 'john@fusemachines.com'),
('Dummy Person', 'dummy@fusemachines.com'),
('Alison Burgers','alison@fusemachines.com'),
('Harka Bahadur','harke@fusemachines.com.np'),
('Ful Kumari','fulkumari@fusemachines.com.np'),
('Chulbul Pandey','chulbul@fusemachines.com'),
('Bir Kaji Sherchan','birkaji@fusemachines.com.np'),
('Maiya Gauchan','maiya@fusemachines.com.np');

 * sqlite://
8 rows affected.

[]

<br/>

>Insert values into `course` table

In [9]:
%%sql
INSERT INTO course (course_name,course_length)
VALUES ('Fundamentals of Computer Science',3),
('Fundamentals of Mathematics',4),
('Machine Learning',5),
('Deep Learning',5),
('Computer Vision',5),
('Natural Language Processing',5);

 * sqlite://
6 rows affected.

[]

<br/>

> Insert values into other tables

In [10]:
%%sql
INSERT INTO enrollment (student_id, course_id) VALUES (1,1),(1,2),(2,1),(3,1),(4,2),(5,1),(6,1),(7,2);
INSERT INTO module(course_id, module_num, module_name) VALUES (1,1,'Introduction to the Course'),(1,2,'Basics of Computer Systems'),(1,3,'Python Programming'),(1,4,'Data Structures and Algorithms'),(1,5,'Database'),(1,6,'Building Applications'),(2,1,'Introduction to the Course'),(2,2,'Linear Algebra'),(2,3,'Calculus'),(2,4,'Probability and Statistics'),(2,5,'Information Theory'),(2,6,'Numerical Computation');
INSERT INTO unit(course_id, module_num, unit_num, unit_name, time_allotted) VALUES (1,1,1,'Introduction to the Course',0.25),(1,1,2,'Introduction to AI',0.5),(1,2,1,'Introduction to the Module',0),(1,2,2,'Digital Information & Digital Logic',1.25),(1,2,3,'Basics Computer Architecture',2),(1,2,4,'Basics of Linux Operating System',1.5),(1,2,5,'Basics of Computer Networks',1.5),(1,2,6,'Module Summary',0),(1,3,1,'Introduction to the Module',0),(1,3,2,'Python Programming',5),(1,3,3,'Object Oriented Programming',4.5),(1,3,4,'Web Scraping',0.75),(1,3,5,'Numpy',2),(1,3,6,'Pandas',2),(1,3,7,'Matplotlib',1),(1,3,8,'Module Summary',0),(2,2,1,'Introduction to the Module',0),(2,2,2,'Scalars Vectors and their operations',1.75),(2,2,3,'Linear transformations and Matrix',1.5),(2,2,4,'Solving Linear Equations',3.75),(2,2,5,'Determinant and Inverses',2.25),(2,2,6,'Orthogonality',2),(2,2,7,'Eigen and Singular Value Decomposition',2.75),(2,2,8,'Module Summary',0),(2,3,1,'Introduction to the Module',0),(2,3,2,'Derivatives',3.25),(2,3,3,'Integrals',2.25),(2,3,4,'Multivariable Calculus',3),(2,3,5,'Optimization of multivariable Functions',2.5),(2,3,6,'Integrals of multivariable functions',2),(2,3,7,'Module Summary',0);
INSERT INTO chapter(course_id, module_num, unit_num, chapter_num, chapter_name) VALUES (1,1,1,1,'Introduction to the Course'),(1,1,1,2,'Course Logistics'),(1,1,2,1,'AI and its applications'),(1,1,2,2,'A Brief History of AI'),(1,1,2,3,'Types of AI'),(1,1,2,4,'Introduction to ML'),(1,2,1,1,'Introduction to the Module'),(1,2,2,1,'Number Representation in computers'),(1,2,2,2,'Digital Information'),(1,2,2,3,'Boolean Operation and algebra');
INSERT INTO project(course_id, module_num, project_title, project_marks) VALUES (2,1,'None',0),(2,2,'3D Reconstruction',200),(2,3,'Shape Optimization',250);
INSERT INTO assignment(course_id, module_num, unit_num, assignment_name, assignment_marks) VALUES (2,2,1,'N/A',0),(2,2,2,'Similarity',60),(2,2,3,'Robotics Forward Kinematics',70),(2,2,4,'Kirchoffs Law: Traffic flow',80),(2,2,5,'Inverse Kinematics',90),(2,2,6,'Least-Squares',100),(2,2,7,'Eigen Faces',110),(2,2,8,'N/A',0),(2,3,1,'N/A',0),(2,3,2,'Robotics Forward Kinematics',60),(2,3,3,'Single variable gradient descent',70),(2,3,4,'Trapezoidal rule',80),(2,3,5,'Image edge detection',90),(2,3,6,'Multi variable gradient descent',100),(2,3,7,'N/A',110);

 * sqlite://
8 rows affected.
12 rows affected.
31 rows affected.
10 rows affected.
3 rows affected.
15 rows affected.

[]

<br/>

### SELECT Statement

**Syntax:**
```
 SELECT "column_name" FROM "table_name"
 SELECT * FROM "table_name"
 SELECT DISTINCT "column_name" FROM "table_name"
```

*  An Asterisk(*) in the select clause denotes all attributes

> Q. Select all tuples from course relation

In [11]:
%sql SELECT * FROM course

 * sqlite://
Done.

[(1, 'Fundamentals of Computer Science', 3),
 (2, 'Fundamentals of Mathematics', 4),
 (3, 'Machine Learning', 5),
 (4, 'Deep Learning', 5),
 (5, 'Computer Vision', 5),
 (6, 'Natural Language Processing', 5)]

In [0]:
%sql SELECT * FROM course;

 * sqlite://
Done.

[(1, 'Fundamentals of Computer Science', 3),
 (2, 'Fundamentals of Mathematics', 4),
 (3, 'Machine Learning', 5),
 (4, 'Deep Learning', 5),
 (5, 'Computer Vision', 5),
 (6, 'Natural Language Processing', 5)]

<br/>

> Q. Select all tuples from module where course_id = 1

In [13]:
%sql SELECT * FROM module WHERE course_id=1

 * sqlite://
Done.

[(1, 1, 'Introduction to the Course'),
 (1, 2, 'Basics of Computer Systems'),
 (1, 3, 'Python Programming'),
 (1, 4, 'Data Structures and Algorithms'),
 (1, 5, 'Database'),
 (1, 6, 'Building Applications')]

In [0]:
%sql SELECT * FROM module WHERE course_id = 1;

 * sqlite://
Done.

[(1, 1, 'Introduction to the Course'),
 (1, 2, 'Basics of Computer Systems'),
 (1, 3, 'Python Programming'),
 (1, 4, 'Data Structures and Algorithms'),
 (1, 5, 'Database'),
 (1, 6, 'Building Applications')]

<br/>

> Q. Select all tuples from a unit of course_id = 1 and module_num = 2

In [14]:
%sql SELECT * from unit where course_id=1 AND module_num=2

 * sqlite://
(sqlite3.OperationalError) near "SELCT": syntax error
[SQL: SELCT * from unit where course_id=1 AND module_num=2]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [15]:
%sql SELECT * FROM unit WHERE course_id = 1 AND module_num = 2;

 * sqlite://
Done.

[(1, 2, 1, 'Introduction to the Module', 0.0),
 (1, 2, 2, 'Digital Information & Digital Logic', 1.25),
 (1, 2, 3, 'Basics Computer Architecture', 2.0),
 (1, 2, 4, 'Basics of Linux Operating System', 1.5),
 (1, 2, 5, 'Basics of Computer Networks', 1.5),
 (1, 2, 6, 'Module Summary', 0.0)]

<br/>

> Q.Select only unit name and time allotted for a unit of first course second module

In [16]:
%sql SELECT unit_name, time_allotted FROM unit WHERE course_id = 1 AND module_num = 2;

 * sqlite://
Done.

[('Introduction to the Module', 0.0),
 ('Digital Information & Digital Logic', 1.25),
 ('Basics Computer Architecture', 2.0),
 ('Basics of Linux Operating System', 1.5),
 ('Basics of Computer Networks', 1.5),
 ('Module Summary', 0.0)]

<br/>

> Q. Display name  of courses whose course length is between 3 to 4 months

In [17]:
%sql SELECT course_name, course_length FROM course WHERE course_length BETWEEN 3 AND 4;

 * sqlite://
Done.

[('Fundamentals of Computer Science', 3), ('Fundamentals of Mathematics', 4)]

In [0]:
%sql SELECT course_name, course_length*4 AS course_length_in_weeks FROM course;

 * sqlite://
Done.

[('Fundamentals of Computer Science', 12),
 ('Fundamentals of Mathematics', 16),
 ('Machine Learning', 20),
 ('Deep Learning', 20),
 ('Computer Vision', 20),
 ('Natural Language Processing', 20)]

> Q. List out the assignment names of all the assignments that have high weightage(greater than 100 marks)

In [20]:
%sql SELECT * FROM assignment WHERE assignment_marks > 100;

 * sqlite://
Done.

[(2, 2, 7, 'Eigen Faces', 110), (2, 3, 7, 'N/A', 110)]

<br/>

SQL includes a string matching operator for comparisions on character string.
* percent(%) character matches any substring
* underscore(_) matches any character


> Q. Find the name of all courses that are Fundamental(have Fundamental in their name)

In [21]:
%sql SELECT * FROM course WHERE course_name LIKE '%Fundamental%';

 * sqlite://
Done.

[(1, 'Fundamentals of Computer Science', 3),
 (2, 'Fundamentals of Mathematics', 4)]

Students of fusemachines from Nepal have country domain `.np` in their email id. For Example: `buddha@fusemachines.com.np`

> Q.List down all the students from Nepal.

In [22]:
%sql SELECT * FROM student WHERE student_email LIKE '%.np%';

 * sqlite://
Done.

[(4, 'Harka Bahadur', 'harke@fusemachines.com.np', None),
 (5, 'Ful Kumari', 'fulkumari@fusemachines.com.np', None),
 (7, 'Bir Kaji Sherchan', 'birkaji@fusemachines.com.np', None),
 (8, 'Maiya Gauchan', 'maiya@fusemachines.com.np', None)]

> Alter Table

**Syntax:** `Alter table <table_name> add <attribute_name> <data_type>`

In [23]:
%sql ALTER TABLE course ADD course_difficulty VARCHAR(20)

 * sqlite://
Done.

[]

In [24]:
%sql SELECT * FROM course

 * sqlite://
Done.

[(1, 'Fundamentals of Computer Science', 3, None),
 (2, 'Fundamentals of Mathematics', 4, None),
 (3, 'Machine Learning', 5, None),
 (4, 'Deep Learning', 5, None),
 (5, 'Computer Vision', 5, None),
 (6, 'Natural Language Processing', 5, None)]

In [25]:
%sql UPDATE course SET course_difficulty = 'easy' WHERE course_id == 1 OR course_id == 2;

 * sqlite://
2 rows affected.

[]

In [26]:
%sql SELECT * FROM course

 * sqlite://
Done.

[(1, 'Fundamentals of Computer Science', 3, 'easy'),
 (2, 'Fundamentals of Mathematics', 4, 'easy'),
 (3, 'Machine Learning', 5, None),
 (4, 'Deep Learning', 5, None),
 (5, 'Computer Vision', 5, None),
 (6, 'Natural Language Processing', 5, None)]

>Delete Table

**Syntax:** `Drop table <table_name>`

In [0]:
%sql drop table course;

 * sqlite://
Done.

[]

In [0]:
%sql select * from course;

 * sqlite://
(sqlite3.OperationalError) no such table: course
[SQL: select * from course;]
(Background on this error at: http://sqlalche.me/e/e3q8)